gallayl/cos/sdkconfig.defaults
# COS sdkconfig defaults
# Only non-default settings are listed here.
# Run `idf.py menuconfig` to customize, or `idf.py build` to generate full sdkconfig.

# Target
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Bluetooth disabled (save flash/RAM)
# CONFIG_BT_ENABLED is not set

# Compiler: no C++ exceptions, no RTTI (save flash/RAM)
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y
